
MAIN_PAGE_URL = 'https://qa-scooter.praktikum-services.ru/'
NO_SUCH_ORDER_URL = 'https://qa-scooter.praktikum-services.ru/track?t='

# ответы на вопросы раздела "ВОПРОСЫ О ВАЖНОМ"
RESPONSE_Q1 = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
RESPONSE_Q2 = ('Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто '
               'сделать несколько заказов — один за другим.')
RESPONSE_Q3 = ('Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени '
               'аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, '
               'суточная аренда закончится 9 мая в 20:30.')
RESPONSE_Q4 = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
RESPONSE_Q5 = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
RESPONSE_Q6 = ('Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься '
               'без передышек и во сне. Зарядка не понадобится.')
RESPONSE_Q7 = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
RESPONSE_Q8 = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'

METRO_STATION_NAMES = ['Бульвар Рокоссовского', 'Черкизовская', 'Преображенская площадь']
RENTAL_DAYS = ['сутки', 'двое суток', 'трое суток']
SCOOTER_COLORS = ['black', 'grey']
NAMES = ['Ирина', 'Наташа', 'Марина']
SURNAMES = ['Печенина', 'Жарова', 'Белова']
ADDRESSES = ['Сеченовский пер., д.7', 'Короленко, д.3', 'Якиманский пер., д.6']

expected_result_yandex_logo = 'Найти'
expected_result_scooter_logo = 'И здесь куки! В общем, мы их используем.'
expected_result_order_is_done = 'Посмотреть статус'
